creating a new instance (with 2.20.1):
```hcl
resource "google_bigtable_instance" "development-instance" {
  name          = "tf-instance"
  instance_type = "DEVELOPMENT"

  cluster {
    cluster_id   = "tf-instance-cluster"
    zone         = "us-central1-b"
    storage_type = "HDD"
  }
}
```

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_bigtable_instance.development-instance will be created
  + resource "google_bigtable_instance" "development-instance" {
      + cluster_id    = (known after apply)
      + display_name  = (known after apply)
      + id            = (known after apply)
      + instance_type = "DEVELOPMENT"
      + name          = "tf-instance"
      + num_nodes     = (known after apply)
      + project       = (known after apply)
      + storage_type  = (known after apply)
      + zone          = (known after apply)

      + cluster {
          + cluster_id   = "tf-instance-cluster"
          + storage_type = "HDD"
          + zone         = "us-central1-b"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

```bash
% tf state show google_bigtable_instance.development-instance
# google_bigtable_instance.development-instance:
resource "google_bigtable_instance" "development-instance" {
    display_name  = "tf-instance"
    id            = "tf-instance"
    instance_type = "DEVELOPMENT"
    name          = "tf-instance"
    project       = "foo"

    cluster {
        cluster_id   = "tf-instance-cluster"
        num_nodes    = 1
        storage_type = "HDD"
        zone         = "us-central1-b"
    }
}
```

however, the next plan shows:
```diff
  # google_bigtable_instance.development-instance will be updated in-place
  ~ resource "google_bigtable_instance" "development-instance" {
        display_name  = "tf-instance"
        id            = "tf-instance"
        instance_type = "DEVELOPMENT"
        name          = "tf-instance"
        project       = "foo"

      ~ cluster {
            cluster_id   = "tf-instance-cluster"
          ~ num_nodes    = 1 -> 0
            storage_type = "HDD"
            zone         = "us-central1-b"
        }
    }
```